app/controllers/lessons_controller.rb

	def index
		@lessons = Lesson.all
---
SELECT "lessons".* FROM "lessons"

	def create
		@lesson = Lesson.new(lesson_params)
		if @lesson.save
---
INSERT INTO "lessons" ("content", "created_at", "lv", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "1111"], ["created_at", "2014-07-29 00:56:09.956394"], ["lv", "12"], ["title", "123"], ["updated_at", "2014-07-29 00:56:09.956394"]]